{
  "backend/main.mo": "Motoko backend actor managing user profiles and appointment requests with access control, validation, and admin-only request retrieval.",
  "feature_evidence.json": "Feature evidence report listing implemented features, associated files, components, and test IDs for the project.",
  "frontend-file-summaries.txt": "Text file containing high-level summaries of all frontend source files for reference.",
  "frontend/index.css": "Tailwind base and theme variable definitions using OKLCH color tokens with light/dark mode support.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for all site pages using SiteLayout as the root layout.",
  "frontend/src/components/BrandSections.tsx": "Provides styled ScriptureBlock and EventHighlight components for branded content sections.",
  "frontend/src/components/LeadershipAvailability.tsx": "Static availability calendar component with legend, styled grid, and a note about appointment confirmation.",
  "frontend/src/components/PageSection.tsx": "Reusable section wrapper supporting backgrounds, padding control, and optional id for anchors.",
  "frontend/src/components/PrimaryCtas.tsx": "Renders primary CTA buttons with layout variations for header, hero, and mobile contexts.",
  "frontend/src/components/SiteFooter.tsx": "Renders the site footer with about text, navigation links, contact link, and a bottom bar with credits.",
  "frontend/src/components/SiteLayout.tsx": "Defines the main page layout including navigation, routed content, and footer.",
  "frontend/src/components/SiteNav.tsx": "Implements responsive site navigation with active link highlighting and mobile menu support.",
  "frontend/src/components/Typography.tsx": "Exports styled typography components for titles and body text.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication and login state.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for appointment requests and user profile operations using the backend actor.",
  "frontend/src/index.css": "Defines Tailwind layers, theme variables, and custom utility classes for site styling.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity providers.",
  "frontend/src/pages/ConnectPage.tsx": "Renders the Connect page with service times, location details, live stream section, and social media prompts.",
  "frontend/src/pages/GatheringAt6Page.tsx": "Renders an event page describing The Gathering at 6, including time, location, schedule, and what attendees can expect.",
  "frontend/src/pages/HomePage.tsx": "Defines the homepage with a hero section, welcome message, core values, and calls to action.",
  "frontend/src/pages/LeadershipGovernancePage.tsx": "Displays leadership structure, details about the Presiding Prelate, availability, and governance framework.",
  "frontend/src/pages/MinistriesPage.tsx": "Lists key ministries offered by the church and encourages users to get involved.",
  "frontend/src/pages/OurMissionPage.tsx": "Explains the church’s mission to connect, empower, and extend outreach, with supporting sections.",
  "frontend/src/pages/OutreachPage.tsx": "Outlines the church’s community outreach efforts and ways they serve through compassion, resources, and events.",
  "frontend/src/pages/ScheduleMeetingPage.tsx": "Implements an authenticated appointment request form with validation, date/time handling, and request submission via a mutation hook.",
  "frontend/src/pages/VisitPage.tsx": "Displays visitor information with sections describing what to expect, featuring icons, descriptions, and navigation links.",
  "frontend/src/pages/WhoWeArePage.tsx": "Provides mission and belief statements using structured sections detailing values, purpose, and ministry focus.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, brand colors, fonts, utilities, and plugin setup.",
  "project_state.json": "Project metadata describing goals, features, requirements, versioning, and image needs for the KMI church website."
}