{
  "backend/main.mo": "Motoko canister handling user profiles and appointment requests with access control for viewing, saving, and admin-only retrieval.",
  "feature_evidence.json": "Aggregated feature evidence listing design updates, affected files, components, and related test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing styling, layout, pages, and thematic updates across frontend components.",
  "frontend/index.css": "Tailwind base layer defining OKLCH color tokens, theming variables, and dark‑mode overrides.",
  "frontend/index.html": "Base HTML document loading the React app entrypoint and metadata.",
  "frontend/public/robots.txt": "Robots.txt allowing all crawlers and referencing sitemap URL.",
  "frontend/public/sitemap.xml": "XML sitemap listing all site routes with priorities and change frequencies.",
  "frontend/src/App.tsx": "React Router setup defining all primary routes and linking them to page components.",
  "frontend/src/components/BrandSections.tsx": "Reusable ScriptureBlock and EventHighlight components rendering stylized religious content sections.",
  "frontend/src/components/home/ServicesSection.tsx": "Shows a grid of service offerings with images, descriptions, optional notes, and CTA links.",
  "frontend/src/components/home/UpcomingEventsSection.tsx": "Displays upcoming events with images, details, and styled event information blocks.",
  "frontend/src/components/LeadershipAvailability.tsx": "Static availability calendar component with legend and styled grid for leadership scheduling.",
  "frontend/src/components/MinistrySealsSection.tsx": "Renders a grid of ministry seal images with dialog popups for enlarged viewing and captions.",
  "frontend/src/components/PageSection.tsx": "Provides a layout wrapper component that applies background, spacing, and container styles to page sections.",
  "frontend/src/components/PrimaryCtas.tsx": "Displays primary call‑to‑action links with different layouts for hero, header, and mobile variants.",
  "frontend/src/components/SeoManager.tsx": "Updates document SEO metadata based on the current route, including title, meta tags, and canonical link.",
  "frontend/src/components/SiteFooter.tsx": "Builds the site footer with branding, quick links, contact link, decorative elements, and copyright line.",
  "frontend/src/components/SiteLayout.tsx": "Defines the main site layout with navigation, footer, SEO manager, and routed content outlet.",
  "frontend/src/components/SiteNav.tsx": "Implements the responsive site navigation bar with logo, links, CTAs, and a toggleable mobile menu.",
  "frontend/src/components/Typography.tsx": "Provides reusable typography components for titles, subtitles, and body text with consistent styling.",
  "frontend/src/content/ministrySeals.ts": "Exports a list of ministry seal and event images with metadata for use in image galleries.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity login, stored identities, and auth-client setup.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for submitting and fetching appointment requests and managing the caller’s user profile via the actor.",
  "frontend/src/index.css": "Sets global Tailwind styles, theme variables, and custom component classes for the app’s visual design.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/ConnectPage.tsx": "Renders the Connect page with service times, location info, live-stream section, and social media placeholders.",
  "frontend/src/pages/GatheringAt6Page.tsx": "Displays details for The Gathering at 6 event including schedule, location, and what attendees can expect.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero banner, welcome text, events, services, and core values sections.",
  "frontend/src/pages/LeadershipGovernancePage.tsx": "Displays leadership roles, bio of the presiding prelate, availability calendar, and governance structure.",
  "frontend/src/pages/MinistriesPage.tsx": "Outlines major ministry areas, shows ministry seals, and invites users to get involved.",
  "frontend/src/pages/OurMissionPage.tsx": "Explains the church’s mission and commitment with highlight sections for Connect, Empower, and Extend.",
  "frontend/src/pages/OutreachPage.tsx": "Describes community outreach efforts with sections on care, resource assistance, and events.",
  "frontend/src/pages/ScheduleMeetingPage.tsx": "Form page allowing authenticated users to request appointments with leaders using detailed form inputs.",
  "frontend/src/pages/VisitPage.tsx": "React page describing what visitors can expect at the church with sections, icon cards, and links to connect pages.",
  "frontend/src/pages/WhoWeArePage.tsx": "React page outlining the church’s identity, beliefs, and purpose using structured sections and feature blocks.",
  "frontend/src/seo/routeMeta.ts": "Defines SEO metadata for routes and provides a helper to retrieve metadata by pathname.",
  "frontend/src/utils/publicAssetUrl.ts": "Utility that builds encoded public URLs for static assets under the /assets path.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, and managing URL parameters and sessionStorage persistence.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme tokens, colors, and utilities for the site’s design system.",
  "project_state.json": "Metadata describing the project state, design goals, required images, and tracked feature updates."
}