{
  "backend/main.mo": "Motoko canister providing user profile management and appointment request submission with access control checks and validation.",
  "feature_evidence.json": "Feature evidence report mapping ministry seals features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Compiled list of concise summaries for all major frontend files describing their purpose and functionality.",
  "frontend/index.css": "Tailwind base config with OKLCH color variables and light/dark theme CSS custom properties.",
  "frontend/index.html": "Base HTML shell loading the React app via root div and main.tsx module.",
  "frontend/src/App.tsx": "Configures TanStack Router routes for all site pages and provides the router to the app.",
  "frontend/src/components/BrandSections.tsx": "Provides styled ScriptureBlock and EventHighlight components for branded content sections.",
  "frontend/src/components/LeadershipAvailability.tsx": "Static availability calendar with legend and explanatory text for leadership scheduling.",
  "frontend/src/components/MinistrySealsSection.tsx": "Displays ministry seals in a responsive grid with dialog popups for full-size image viewing.",
  "frontend/src/components/PageSection.tsx": "Reusable page section wrapper with configurable background, padding, and ID.",
  "frontend/src/components/PrimaryCtas.tsx": "Primary CTA component rendering visit, watch live, and scheduling links in multiple layout variants.",
  "frontend/src/components/SiteFooter.tsx": "Footer component with about text, navigation links, contact link, and a bottom copyright bar.",
  "frontend/src/components/SiteLayout.tsx": "Defines the main page layout with navigation, content outlet, and footer.",
  "frontend/src/components/SiteNav.tsx": "Responsive site navigation bar with logo, links, CTAs, and a mobile menu toggle.",
  "frontend/src/components/Typography.tsx": "Provides styled typography components for titles, subtitles, and body text.",
  "frontend/src/content/ministrySeals.ts": "Exports an array of ministry seal and event image metadata.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on Internet Identity state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity login, state, and persistence.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for submitting appointments, retrieving requests, and managing user profiles.",
  "frontend/src/index.css": "Tailwind setup with custom color tokens, themes, and component utility classes.",
  "frontend/src/main.tsx": "Application entry point initializing React, query client, Internet Identity provider, and global styles.",
  "frontend/src/pages/ConnectPage.tsx": "Renders the Connect page with service times, location details, live stream info, and social media sections, including hash-based scroll behavior.",
  "frontend/src/pages/GatheringAt6Page.tsx": "Displays information about The Gathering at 6 event, including schedule, location, and what attendees can expect.",
  "frontend/src/pages/HomePage.tsx": "Builds the homepage with a hero banner, welcome message, core values, and links to key areas of the site.",
  "frontend/src/pages/LeadershipGovernancePage.tsx": "Shows leadership and governance details, including the presiding prelate, availability calendar, and organizational structure.",
  "frontend/src/pages/MinistriesPage.tsx": "Outlines the church’s ministries, ministry seals, and ways for members to get involved.",
  "frontend/src/pages/OurMissionPage.tsx": "Presents the church’s mission, core focus areas (Connect, Empower, Extend), and overall commitments.",
  "frontend/src/pages/OutreachPage.tsx": "Renders the Outreach page with sections describing community service efforts and highlights key outreach programs.",
  "frontend/src/pages/ScheduleMeetingPage.tsx": "Implements a detailed appointment request form with authentication checks, date/time handling, and submission via a mutation hook.",
  "frontend/src/pages/VisitPage.tsx": "Displays visitor information with sections describing what to expect and links to additional resources.",
  "frontend/src/pages/WhoWeArePage.tsx": "Shows information about the organization’s mission, beliefs, and purpose across structured sections.",
  "frontend/src/utils/publicAssetUrl.ts": "Provides a helper to build encoded public asset URLs under the /assets path.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters with session persistence support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, typography, layout, and animations with custom theme values.",
  "project_state.json": "Defines project state for building a Wix-based church website, including brand palette, required pages, features, governance content, and known issues. Flags appointment scheduling as a request workflow and notes missing ministry seal images as a fix request."
}