{
  "backend/main.mo": "Motoko canister managing user profiles, appointment submissions, and prayer requests with access control and validation.",
  "feature_evidence.json": "Feature evidence metadata linking feature requests to impacted frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing styles, components, and pages across the frontend codebase.",
  "frontend/index.css": "Tailwind base theme variables and light/dark mode OKLCH color tokens applied across the app.",
  "frontend/index.html": "Base HTML file mounting the React app and loading main.tsx with standard metadata and favicon.",
  "frontend/public/robots.txt": "Robots policy allowing all crawlers and pointing to sitemap.",
  "frontend/public/sitemap.xml": "Static sitemap listing public site URLs with change frequency and priority.",
  "frontend/src/App.tsx": "React Router setup defining all routes and pages with a root SiteLayout wrapper.",
  "frontend/src/components/BrandSections.tsx": "Two simple wrapper components, ScriptureBlock and EventHighlight, for styled section containers.",
  "frontend/src/components/home/EventsTicker.tsx": "Shows a scrolling ticker of recurring ministry events.",
  "frontend/src/components/home/FeaturedEventCard.tsx": "Displays details for a featured event with options for directions, calendar download, and online participation.",
  "frontend/src/components/home/PrayerAndCareSection.tsx": "Offers prayer request and emergency prayer options, including a dialog for urgent alerts.",
  "frontend/src/components/home/ScriptureOfTheDay.tsx": "Shows the daily scripture with text and reference in a styled card.",
  "frontend/src/components/home/ServicesSection.tsx": "Lists key ministry services with times, details, and links to learn more.",
  "frontend/src/components/home/UpcomingEventsSection.tsx": "Displays a grid of upcoming event cards using static event data with images and details.",
  "frontend/src/components/LeadershipAvailability.tsx": "Static availability calendar for the Chief Apostle with status legend and styled grid display.",
  "frontend/src/components/MinistrySealsSection.tsx": "Grid displaying ministry seal images with modal dialog for enlarged viewing.",
  "frontend/src/components/PageSection.tsx": "Reusable section wrapper applying background variants and spacing for layout consistency.",
  "frontend/src/components/prayer/EmergencyPrayerDialog.tsx": "Modal dialog for submitting emergency prayer requests, handling form state and async submission.",
  "frontend/src/components/PrimaryCtas.tsx": "Renders primary call‑to‑action buttons with different layouts for hero, header, and mobile variants.",
  "frontend/src/components/SeoManager.tsx": "Updates page metadata, canonical tags, and social tags based on the current route.",
  "frontend/src/components/SiteFooter.tsx": "Displays the site footer with ministry info, service times, quick links, location details, and a credit bar.",
  "frontend/src/components/SiteLayout.tsx": "Defines the main page layout including SEO manager, navigation, content outlet, and footer.",
  "frontend/src/components/SiteNav.tsx": "Provides the site navigation bar with desktop and mobile menus, branding, and quick-access CTAs.",
  "frontend/src/components/Typography.tsx": "Exports styled typography components for titles, subtitles, and body text.",
  "frontend/src/content/ministrySeals.ts": "Exports a catalog of ministry seal and event flyer images with metadata and categories.",
  "frontend/src/content/scriptureOfTheDay.ts": "Provides a rotating daily scripture selection based on day of year.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages the backend actor based on Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and logic for managing Internet Identity authentication and login state.",
  "frontend/src/hooks/usePrayerRequests.ts": "React-query hooks for submitting and fetching prayer and emergency prayer requests via the backend actor.",
  "frontend/src/hooks/useQueries.ts": "React-query hooks for appointment requests and user profiles, including submit, fetch, and save actions.",
  "frontend/src/index.css": "Defines Tailwind-based global styles and custom color variables for the app's branding.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/AboutMinistryPage.tsx": "A detailed ministry overview page presenting vision, apostolic and prophetic mandate, and mission with styled sections and images.",
  "frontend/src/pages/ConnectPage.tsx": "Provides contact details, live‑stream info, and a hero section encouraging users to connect with the ministry.",
  "frontend/src/pages/GatheringAt6Page.tsx": "Introduces the Gathering at 6 event with time, location, schedule details, and what attendees can expect.",
  "frontend/src/pages/GetInvolvedPage.tsx": "Explains service opportunities and lists ministry auxiliaries with icons and descriptions for involvement.",
  "frontend/src/pages/HomePage.tsx": "Home page featuring a hero banner, scripture displays, event components, and sections about services and care.",
  "frontend/src/pages/KmiFellowshipPage.tsx": "Describes KMI Fellowship’s vision, leadership covering, and outlines its governing colleges and assemblies.",
  "frontend/src/pages/KmiGovernancePage.tsx": "Presents KMI’s apostolic governance structure with hero styling and descriptive sections about order, oversight, and leadership roles.",
  "frontend/src/pages/LeadershipGovernancePage.tsx": "Displays leadership and governance details including the presiding prelate, governance structure, and ministry leadership roles with images and icons.",
  "frontend/src/pages/LeadershipPage.tsx": "Shows leadership highlights focusing on Senior Leader Dr. Virgil Postell, including biography, ministry description, and schedule elements.",
  "frontend/src/pages/LearningStudyPage.tsx": "Provides a study resource hub with Bible translation buttons and an AI research tool for scriptural questions.",
  "frontend/src/pages/MinistriesPage.tsx": "Outlines various ministry opportunities with descriptive sections and includes a seals section and call to action.",
  "frontend/src/pages/OurMissionPage.tsx": "Defines KMI’s mission, purpose, and pillars—Connect, Empower, Extend—along with value-focused content sections.",
  "frontend/src/pages/OutreachPage.tsx": "Describes community outreach efforts, service programs, and commitment to compassionate assistance and events.",
  "frontend/src/pages/PrayerRequestPage.tsx": "Renders a prayer request form with fields, urgency selection, and submission handling, showing a confirmation screen after successful submit.",
  "frontend/src/pages/PropheticTrainingPage.tsx": "Displays information about prophetic training programs, including course details, schedule, and call-in info.",
  "frontend/src/pages/ScheduleMeetingPage.tsx": "Provides an authenticated appointment request form with date/time selection, request type mapping, and backend submission.",
  "frontend/src/pages/VisitPage.tsx": "Shows visitor information including what to expect, service details, and location highlights.",
  "frontend/src/pages/WhoWeArePage.tsx": "Presents organizational identity, beliefs, and purpose using structured sections and descriptions.",
  "frontend/src/pages/WorshipServicesPage.tsx": "Details online and in-person worship services with schedules, descriptions, and call-in information.",
  "frontend/src/seo/routeMeta.ts": "Defines route metadata with titles and descriptions and provides a helper to retrieve metadata by path with a fallback.",
  "frontend/src/utils/publicAssetUrl.ts": "Generates public asset URLs by URL‑encoding path segments and prefixing them with /assets/.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, and container settings with custom oklch-based theme variables.",
  "project_state.json": "Project state describing required fixes for ministry labels and modern imagery, along with existing and pending feature requests."
}