{
  "kind": "build_request",
  "title": "Display uploaded ministry seals on the website",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-9",
      "text": "Add a new \"Ministry Seals\" section to the Our Ministries page that visibly displays the uploaded ministry seal images in a responsive grid (clickable to view larger).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Where's our SEALs at for the web page? I don't see them on the web page. Can you update it?"
        ]
      },
      "acceptanceCriteria": [
        "Navigating to /ministries shows a clearly labeled \"Ministry Seals\" section.",
        "The section displays the uploaded seal artwork image(s) (at minimum the combined-seals image \"ChatGPT Image Feb 5, 2026 at 11_34_19 PM.png\" and its duplicates if retained) as actual images (not broken links).",
        "The seal images render in a responsive layout (1 column on mobile, 2+ columns on larger screens) and do not overflow the page.",
        "Each seal image has meaningful alt text and can be clicked to view a larger version (new tab or lightbox-style overlay)."
      ]
    },
    {
      "id": "REQ-10",
      "text": "Ensure all uploaded seal-related image assets are included in the frontend as static files and referenced using stable public paths so they load reliably in production builds.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "All right, these are the ministry seals."
        ]
      },
      "acceptanceCriteria": [
        "The following uploaded files are present in the frontend static assets and can be loaded directly by URL in the deployed site build: F0B90583-110F-4D38-A623-55660CA4DF70.png, The Gathering at 6 launch service.png, ChatGPT Image Feb 5, 2026 at 11_34_19 PM.png, church.png, save the date with us.png, save the date with us-1.png, The Gathering at 6 launch service-1.png, F0B90583-110F-4D38-A623-55660CA4DF70-1.png, church-1.png, ChatGPT Image Feb 5, 2026 at 11_34_19 PM-1.png, save the date with us-2.png, church-2.png, The Gathering at 6 launch service-2.png, F0B90583-110F-4D38-A623-55660CA4DF70-2.png, ChatGPT Image Feb 5, 2026 at 11_34_19 PM-2.png.",
        "No image included in the \"Ministry Seals\" section 404s or renders as a broken image in the browser.",
        "Image file names with spaces (e.g., \"The Gathering at 6 launch service.png\") are handled so they load correctly (either by renaming to URL-safe names and updating references, or by correct URL encoding)."
      ]
    }
  ],
  "constraints": [
    "Frontend paths listed as immutable must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui (compose only).",
    "Do not add or require any backend changes for displaying images; images must be served as static frontend assets."
  ],
  "nonGoals": [
    "Do not redesign the overall site navigation, routing, or existing page content beyond adding the requested seal visibility.",
    "Do not implement a CMS or admin uploader as part of this request."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}