{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Get Involved label fix and refreshed Ministries imagery",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Rename the Ministry Auxiliaries item from “Altar Bearers” to “Armor Bearers” on the Get Involved page.",
      "acceptanceCriteria": [
        "On /get-involved, within the “Ministry Auxiliaries” grid, the item title reads “Armor Bearers”.",
        "No visible occurrences of “Alter Bearers” or “Altar Bearers” remain on the Get Involved page."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/GetInvolvedPage.tsx",
          "operation": "modify",
          "description": "Update the Ministry Auxiliaries grid data so the item currently titled “Altar Bearers” displays “Armor Bearers”, and ensure no remaining occurrences of the old label appear on this page."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Replace the Ministries page “Ministry Seals” imagery with newly generated modern, youthful assets and update the image catalog to reference the new static files.",
      "acceptanceCriteria": [
        "The images shown in the Ministries page “Ministry Seals” section use newly generated, modern-looking assets (not the prior dated-looking images).",
        "New images are stored as static assets under frontend/public/assets/generated and referenced from the frontend (not served via the backend).",
        "All updated ministry images visually read as modern/current (clean typography, contemporary photo/graphic style, vibrant and youthful tone)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/ministry-seals-modern-collage.dim_1200x1200.png",
          "operation": "create",
          "description": "Add the newly generated modern collage image asset for the Ministries page Ministry Seals section as a static public asset."
        },
        {
          "path": "frontend/public/assets/generated/gathering-at-6-modern-flyer.dim_1200x1200.png",
          "operation": "create",
          "description": "Add the newly generated modern 'Gathering at 6' flyer-style image asset as a static public asset."
        },
        {
          "path": "frontend/public/assets/generated/save-the-date-modern-flyer.dim_1200x1200.png",
          "operation": "create",
          "description": "Add the newly generated modern 'Save the Date' flyer-style image asset as a static public asset."
        },
        {
          "path": "frontend/public/assets/generated/church-outreach-modern.dim_1200x1200.png",
          "operation": "create",
          "description": "Add the newly generated modern community outreach photo-style image asset as a static public asset."
        },
        {
          "path": "frontend/src/content/ministrySeals.ts",
          "operation": "modify",
          "description": "Replace the existing Ministry Seals image catalog entries to reference the new static assets under 'generated/' (ministry-seals-modern-collage.dim_1200x1200.png, gathering-at-6-modern-flyer.dim_1200x1200.png, save-the-date-modern-flyer.dim_1200x1200.png, church-outreach-modern.dim_1200x1200.png) and update alt text as needed to match the refreshed visuals."
        }
      ]
    }
  ]
}